<?php

return [
    // Course policy
    'course' => [
        'view_any' => [
            'deny' => 'У вас нет прав для просмотра списка курсов.',
        ],
        'view' => [
            'deny' => 'У вас нет прав для просмотра этого курса',
        ],
        'update' => [
            'deny' => 'У вас нет прав для обновления этого курса',
            'not_enrolled' => 'Вы не состоите в данном курсе.'
        ],
        'delete' => [
            'deny' => 'У вас нет прав для архивации этого курса',
        ],
        'hard_delete' => [
            'deny' => 'У вас нет прав для полного удаления курсов',
        ],
        'restore' => [
            'deny' => 'У вас нет прав для восстановления этого курса',
        ],
        'generate_teacher_code' => [
            'deny' => 'У вас нет прав для генерации инвайт-кода учителя',
        ],
        'remove_user' => [
            'cannot_remove_self' => 'Вы не можете удалить себя из курса',
            'deny' => 'У вас нет прав для удаления пользователей из этого курса',
        ],
        'close' => [
            'already_closed' => 'Курс уже закрыт',
            'deny' => 'У вас нет прав для закрытия этого курса',
        ],
        'reopen' => [
            'already_open' => 'Курс уже открыт',
            'deny' => 'У вас нет прав для открытия этого курса',
        ],
        'regenerate_invite' => [
            'course_closed' => 'Курс закрыт',
            'deny' => 'У вас нет прав для перегенерации инвайт-кода',
        ],
        'get_users' => [
            'deny' => 'У вас не права для просмотра пользователей курса',
            'not_enrolled' => 'Вы не состоите в данном курсе.'
        ]
    ],
// Discipline policy
    'discipline' => [
        'view_any' => [
            'deny' => 'У вас нет прав для просмотра списка дисциплин.',
        ],
        'view' => [
            'deny' => 'У вас нет прав для просмотра этой дисциплины в этом курсе',
        ],
        'create' => [
            'deny' => 'У вас нет прав для создания дисциплин в этом курсе',
        ],
        'update' => [
            'deny' => 'У вас нет прав для обновления дисциплин в этом курсе',
        ],
        'delete' => [
            'deny' => 'У вас нет прав для удаления этой дисциплины в этом курсе',
        ],
    ],
// File policy
    'file' => [
        'view_any' => [
            'deny' => 'У вас нет прав для просмотра списка файлов.',
        ],
        'view' => [
            'deny' => 'У вас нет прав для просмотра этого файла',
        ],
        'check_course_access' => [
            'deny' => 'Вы не можете просматривать файлы других студентов в этом курсе',
        ],
        'view_any_in_course' => [
            'deny' => 'Только учителя могут просматривать все файлы в курсе',
        ],
        'view_student_files' => [
            'deny' => 'Вы не можете просматривать файлы этого студента',
        ],
        'update' => [
            'deny' => 'У вас нет прав для обновления файлов',
        ],
        'delete' => [
            'deny' => 'У вас нет прав для удаления файлов',
        ],
    ],
    // task policy
    'task' => [
        'view_any' => [
            'deny' => 'У вас нет прав для просмотра списка заданий.',
        ],
        'view' => [
            'deny' => 'У вас нет прав для просмотра этого задания в этом курсе',
        ],
        'create' => [
            'deny' => 'У вас нет прав для создания заданий в этом курсе',
        ],
        'update' => [
            'deny' => 'У вас нет прав для обновления заданий в этом курсе',
        ],
        'delete' => [
            'deny' => 'У вас нет прав для удаления этого задания в этом курсе',
        ],
    ],
    // user policy
    'user' => [
        'view' => [
            'deny' => 'У вас нет прав для просмотра этого пользователя',
        ],
        'view_list' => [
            'deny' => 'У вас нет прав для просмотра списка пользователей',
        ],
        'update' => [
            'deny' => 'У вас нет прав для обновления пользователей',
        ],
        'delete' => [
            'deny' => 'У вас нет прав для удаления пользователей',
            'cannot_delete_self' => 'Вы не можете удалить самого себя',
        ],
        'set_role' => [
            'deny' => 'У вас нет прав для назначения ролей',
            'cannot_change_self' => 'Вы не можете изменить свою собственную роль',
        ],
    ],

];
